blog/content/post/ai-cv.org
+++
title = "04 - AI Engineering from scratch: do pixel ao modelo de mundo"
description = "Como máquinas aprendem a enxergar, de convoluções 3x3 a difusão de vídeo"
date = 2026-05-25T20:00:00-03:00
tags = ["AI", "computer-vision", "cnn", "diffusion", "yolo", "vit", "pytorch", "python"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Uma imagem digital é uma matriz de números. Um pixel é um valor entre 0 e 255. Três canais (RGB) por pixel, 224 linhas, 224 colunas. Isso dá 150 mil números. E em cima desses 150 mil números a gente constrói modelos que reconhecem rostos, dirigem carros, geram arte e simulam física.

Visão computacional é o campo que ensina máquinas a extrair significado de pixels. Este artigo percorre 28 tópicos, dos fundamentos de imagem até modelos de mundo que preveem o futuro em vídeo. A stack é Python (PyTorch) pra treino e experimentação, Go pra inferência em produção.

* Como uma imagem vira tensor

Tudo começa com o pipeline de pré-processamento. Você carrega um JPEG, decodifica os pixels, converte o espaço de cor, redimensiona, recorta, normaliza e transpõe. Cada passo tem uma razão. Pular um quebra o modelo silenciosamente: acurácia cai, e você não sabe por quê.

O formato HWC (Height-Width-Channel) é o que PIL e OpenCV usam. O formato CHW (Channel-Height-Width) é o que PyTorch e cuDNN esperam. A conversão ~transpose(2, 0, 1)~ é a linha mais frequente em código de visão. E a normalização do ImageNet (~mean=[0.485, 0.456, 0.406], std=[0.229, 0.224, 0.225]~) é a constante mais importante do campo: todo modelo pré-treinado espera esses valores. Se você normalizar errado, o modelo não vai dar erro, só vai performar mal.

#+BEGIN_SRC python
from torchvision import transforms

pipeline = transforms.Compose([
    transforms.Resize(256),
    transforms.CenterCrop(224),
    transforms.ToTensor(),               # HWC -> CHW, [0,255] -> [0,1]
    transforms.Normalize(
        mean=[0.485, 0.456, 0.406],
        std=[0.229, 0.224, 0.225],
    ),
])
#+END_SRC

