ai-cv/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>04 - AI Engineering from scratch: do pixel ao modelo de mundo — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="https://lobovit.github.io/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>04 - AI Engineering from scratch: do pixel ao modelo de mundo</h1>
    <p class="meta"><time>2026-05-25</time> · <span class="tag">AI</span><span class="tag">computer-vision</span><span class="tag">cnn</span><span class="tag">diffusion</span><span class="tag">yolo</span><span class="tag">vit</span><span class="tag">pytorch</span><span class="tag">python</span></p>
  </header>
  <div class="content">
    
<p>
Uma imagem digital é uma matriz de números. Um pixel é um valor entre 0 e 255. Três canais (RGB) por pixel, 224 linhas, 224 colunas. Isso dá 150 mil números. E em cima desses 150 mil números a gente constrói modelos que reconhecem rostos, dirigem carros, geram arte e simulam física.</p>
<p>
Visão computacional é o campo que ensina máquinas a extrair significado de pixels. Este artigo percorre 28 tópicos, dos fundamentos de imagem até modelos de mundo que preveem o futuro em vídeo. A stack é Python (PyTorch) pra treino e experimentação, Go pra inferência em produção.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Como uma imagem vira tensor
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Tudo começa com o pipeline de pré-processamento. Você carrega um JPEG, decodifica os pixels, converte o espaço de cor, redimensiona, recorta, normaliza e transpõe. Cada passo tem uma razão. Pular um quebra o modelo silenciosamente: acurácia cai, e você não sabe por quê.</p>
<p>
O formato HWC (Height-Width-Channel) é o que PIL e OpenCV usam. O formato CHW (Channel-Height-Width) é o que PyTorch e cuDNN esperam. A conversão <code>transpose(2, 0, 1)</code> é a linha mais frequente em código de visão. E a normalização do ImageNet (<code>mean=[0.485, 0.456, 0.406], std=[0.229, 0.224, 0.225]</code>) é a constante mais importante do campo: todo modelo pré-treinado espera esses valores. Se você normalizar errado, o modelo não vai dar erro, só vai performar mal.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">from</span> <span class="nn">torchvision</span> <span class="kn">import</span> <span class="n">transforms</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">pipeline</span> <span class="o">=</span> <span class="n">transforms</span><span class="o">.</span><span class="n">Compose</span><span class="p">([</span>
</span></span><span class="line"><span class="cl">    <span class="n">transforms</span><span class="o">.</span><span class="n">Resize</span><span class="p">(</span><span class="mi">256</span><span class="p">),</span>
</span></span><span class="line"><span class="cl">    <span class="n">transforms</span><span class="o">.</span><span class="n">CenterCrop</span><span class="p">(</span><span class="mi">224</span><span class="p">),</span>
</span></span><span class="line"><span class="cl">    <span class="n">transforms</span><span class="o">.</span><span class="n">ToTensor</span><span class="p">(),</span>               <span class="c1"># HWC -&gt; CHW, [0,255] -&gt; [0,1]</span>
</span></span><span class="line"><span class="cl">    <span class="n">transforms</span><span class="o">.</span><span class="n">Normalize</span><span class="p">(</span>
</span></span><span class="line"><span class="cl">        <span class="n">mean</span><span class="o">=</span><span class="p">[</span><span class="mf">0.485</span><span class="p">,</span> <span class="mf">0.456</span><span class="p">,</span> <span class="mf">0.406</span><span class="p">],</span>
</span></span><span class="line"><span class="cl">        <span class="n">std</span><span class="o">=</span><span class="p">[</span><span class="mf">0.229</span><span class="p">,</span> <span class="mf">0.224</span><span class="p">,</span> <span class="mf">0.225</span><span class="p">],</span>
</span></span><span class="line"><span class="cl">    <span class="p">),</span>
</span></span><span class="line"><span class="cl"><span class="p">])</span></span></span></code></pre></div>
</div>
</div>
</div>
