blog/content/post/ai-cv.org
* Convoluções: o tijolo da visão

Uma convolução é um filtro que desliza sobre a imagem. Em cada posição, multiplica elemento a elemento e soma. O resultado é um mapa de ativação que responde a um padrão específico: bordas horizontais, bordas verticais, texturas, cantos.

O que faz a convolução ser perfeita pra visão: compartilhamento de pesos. O mesmo kernel de 3x3 (9 parâmetros) é aplicado em todas as 50 mil posições da imagem. Compare com uma camada densa que precisaria de milhões de parâmetros. E a equivariância à translação: se o objeto se move 5 pixels pra direita, o mapa de ativação também se move 5 pixels. A rede "sabe" onde as coisas estão.

A fórmula do tamanho de saída: ~(H - K + 2P) / S + 1~. Com kernel 3x3, padding 1 e stride 1, o tamanho se preserva. Com stride 2, reduz pela metade (downsampling). Duas convoluções 3x3 empilhadas têm o mesmo campo receptivo de uma 5x5, com menos parâmetros e uma não-linearidade extra no meio. Por isso todo mundo empilha 3x3.

#+BEGIN_SRC python
import numpy as np

def conv2d_naive(x, kernel, stride=1, padding=0):
    C_in, H, W = x.shape
    C_out, _, K, _ = kernel.shape
    H_out = (H - K + 2*padding) // stride + 1
    W_out = (W - K + 2*padding) // stride + 1
    out = np.zeros((C_out, H_out, W_out))

    if padding > 0:
        x = np.pad(x, ((0,0), (padding,padding), (padding,padding)))

    for oc in range(C_out):
        for h in range(H_out):
            for w in range(W_out):
                patch = x[:, h*stride:h*stride+K, w*stride:w*stride+K]
                out[oc, h, w] = np.sum(kernel[oc] * patch)
    return out

# Filtro de Sobel: detecta bordas horizontais
sobel_h = np.array([[[[-1,-2,-1],[0,0,0],[1,2,1]]]])
#+END_SRC

O truque im2col acelera isso 100x: rearranje cada janela de convolução como uma coluna de matriz, achate o kernel como linhas, e a convolução inteira vira uma multiplicação de matrizes. É assim que o PyTorch faz por baixo (via cuDNN).

