ai-cv/index.html
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Convoluções: o tijolo da visão
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
Uma convolução é um filtro que desliza sobre a imagem. Em cada posição, multiplica elemento a elemento e soma. O resultado é um mapa de ativação que responde a um padrão específico: bordas horizontais, bordas verticais, texturas, cantos.</p>
<p>
O que faz a convolução ser perfeita pra visão: compartilhamento de pesos. O mesmo kernel de 3x3 (9 parâmetros) é aplicado em todas as 50 mil posições da imagem. Compare com uma camada densa que precisaria de milhões de parâmetros. E a equivariância à translação: se o objeto se move 5 pixels pra direita, o mapa de ativação também se move 5 pixels. A rede &#34;sabe&#34; onde as coisas estão.</p>
<p>
A fórmula do tamanho de saída: <code>(H - K + 2P) / S + 1</code>. Com kernel 3x3, padding 1 e stride 1, o tamanho se preserva. Com stride 2, reduz pela metade (downsampling). Duas convoluções 3x3 empilhadas têm o mesmo campo receptivo de uma 5x5, com menos parâmetros e uma não-linearidade extra no meio. Por isso todo mundo empilha 3x3.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">conv2d_naive</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">kernel</span><span class="p">,</span> <span class="n">stride</span><span class="o">=</span><span class="mi">1</span><span class="p">,</span> <span class="n">padding</span><span class="o">=</span><span class="mi">0</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">C_in</span><span class="p">,</span> <span class="n">H</span><span class="p">,</span> <span class="n">W</span> <span class="o">=</span> <span class="n">x</span><span class="o">.</span><span class="n">shape</span>
</span></span><span class="line"><span class="cl">    <span class="n">C_out</span><span class="p">,</span> <span class="n">_</span><span class="p">,</span> <span class="n">K</span><span class="p">,</span> <span class="n">_</span> <span class="o">=</span> <span class="n">kernel</span><span class="o">.</span><span class="n">shape</span>
</span></span><span class="line"><span class="cl">    <span class="n">H_out</span> <span class="o">=</span> <span class="p">(</span><span class="n">H</span> <span class="o">-</span> <span class="n">K</span> <span class="o">+</span> <span class="mi">2</span><span class="o">*</span><span class="n">padding</span><span class="p">)</span> <span class="o">//</span> <span class="n">stride</span> <span class="o">+</span> <span class="mi">1</span>
</span></span><span class="line"><span class="cl">    <span class="n">W_out</span> <span class="o">=</span> <span class="p">(</span><span class="n">W</span> <span class="o">-</span> <span class="n">K</span> <span class="o">+</span> <span class="mi">2</span><span class="o">*</span><span class="n">padding</span><span class="p">)</span> <span class="o">//</span> <span class="n">stride</span> <span class="o">+</span> <span class="mi">1</span>
</span></span><span class="line"><span class="cl">    <span class="n">out</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">zeros</span><span class="p">((</span><span class="n">C_out</span><span class="p">,</span> <span class="n">H_out</span><span class="p">,</span> <span class="n">W_out</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">padding</span> <span class="o">&gt;</span> <span class="mi">0</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="n">x</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">pad</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="p">((</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">),</span> <span class="p">(</span><span class="n">padding</span><span class="p">,</span><span class="n">padding</span><span class="p">),</span> <span class="p">(</span><span class="n">padding</span><span class="p">,</span><span class="n">padding</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="k">for</span> <span class="n">oc</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">C_out</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">h</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">H_out</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">            <span class="k">for</span> <span class="n">w</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">W_out</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">                <span class="n">patch</span> <span class="o">=</span> <span class="n">x</span><span class="p">[:,</span> <span class="n">h</span><span class="o">*</span><span class="n">stride</span><span class="p">:</span><span class="n">h</span><span class="o">*</span><span class="n">stride</span><span class="o">+</span><span class="n">K</span><span class="p">,</span> <span class="n">w</span><span class="o">*</span><span class="n">stride</span><span class="p">:</span><span class="n">w</span><span class="o">*</span><span class="n">stride</span><span class="o">+</span><span class="n">K</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">                <span class="n">out</span><span class="p">[</span><span class="n">oc</span><span class="p">,</span> <span class="n">h</span><span class="p">,</span> <span class="n">w</span><span class="p">]</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">sum</span><span class="p">(</span><span class="n">kernel</span><span class="p">[</span><span class="n">oc</span><span class="p">]</span> <span class="o">*</span> <span class="n">patch</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">out</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Filtro de Sobel: detecta bordas horizontais</span>
</span></span><span class="line"><span class="cl"><span class="n">sobel_h</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([[[[</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span><span class="o">-</span><span class="mi">2</span><span class="p">,</span><span class="o">-</span><span class="mi">1</span><span class="p">],[</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">],[</span><span class="mi">1</span><span class="p">,</span><span class="mi">2</span><span class="p">,</span><span class="mi">1</span><span class="p">]]]])</span></span></span></code></pre></div>
</div>
<p>
O truque im2col acelera isso 100x: rearranje cada janela de convolução como uma coluna de matriz, achate o kernel como linhas, e a convolução inteira vira uma multiplicação de matrizes. É assim que o PyTorch faz por baixo (via cuDNN).</p>
</div>
</div>
