blog/content/post/ai-cv.org
* A árvore genealógica das CNNs

Toda CNN dos últimos 30 anos é a mesma receita (convolução, não-linearidade, downsampling) com uma ideia nova colada. Entender a árvore genealógica resolve 80% das decisões de arquitetura.

LeNet-5 (1998, LeCun) inventou o template: conv, pool, conv, pool, fully-connected. Funcionava pra dígitos manuscritos (MNIST). AlexNet (2012, Krizhevsky) adicionou ReLU (em vez de tanh), Dropout e profundidade. Ganhou o ImageNet por 10 pontos percentuais e começou a era do deep learning.

VGG (2014) provou que profundidade importa mais que truques: 16 camadas de convoluções 3x3 empilhadas, zero invenção. Inception (Google, 2014) rodou convoluções 1x1, 3x3 e 5x5 em paralelo e concatenou os resultados, capturando padrões em múltiplas escalas.

ResNet (2015, He) resolveu o problema da degradação. Redes com 20 camadas treinavam melhor que redes com 56 camadas. A causa: vanishing gradients. A solução: skip connections. ~y = F(x) + x~. O ~+x~ é um atalho de identidade que dá ao gradiente um caminho direto de volta, sem passar por nenhuma camada. Isso permite 152 camadas sem perder sinal.

#+BEGIN_SRC python
import torch
import torch.nn as nn

class BasicBlock(nn.Module):
    def __init__(self, in_ch, out_ch, stride=1):
        super().__init__()
        self.conv1 = nn.Conv2d(in_ch, out_ch, 3, stride, 1, bias=False)
        self.bn1 = nn.BatchNorm2d(out_ch)
        self.conv2 = nn.Conv2d(out_ch, out_ch, 3, 1, 1, bias=False)
        self.bn2 = nn.BatchNorm2d(out_ch)
        self.shortcut = nn.Sequential()
        if stride != 1 or in_ch != out_ch:
            self.shortcut = nn.Sequential(
                nn.Conv2d(in_ch, out_ch, 1, stride, bias=False),
                nn.BatchNorm2d(out_ch))

    def forward(self, x):
        out = torch.relu(self.bn1(self.conv1(x)))
        out = self.bn2(self.conv2(out))
        out += self.shortcut(x)
        return torch.relu(out)
#+END_SRC

A skip connection do ResNet é o padrão por trás de todo transformer moderno (o ~x + attention(x)~ do GPT é a mesma ideia). O que era um truque pra CNNs virou a arquitetura da linguagem.

* Classificação, fine-tuning e o que fazer com um modelo pré-treinado

Treinar um classificador do zero exige milhões de imagens e dias de GPU. O que você faz na prática: pegue uma ResNet ou ConvNeXt pré-treinada no ImageNet (14 milhões de imagens, 1000 classes), congele o backbone e treine só uma nova cabeça de classificação. Isso é transfer learning.

Se você tem muitos dados (10k+ por classe) e seu domínio é próximo do ImageNet (fotos naturais), descongele tudo e faça fine-tuning com learning rate 10x menor. Se tem poucos dados (<1k por classe), congele tudo menos a última camada. Se o domínio é distante (imagens médicas, satélite, microscopia), o fine-tuning ajuda menos e você pode precisar treinar mais camadas.

Taxas de aprendizado discriminativas: as primeiras camadas (que detectam bordas e texturas, genéricas) recebem atualizações pequenas (lr/100). As últimas (específicas da tarefa) recebem a taxa normal. Progressive unfreezing: descongele uma camada por época, da última pra primeira.

#+BEGIN_SRC python
import torchvision.models as models

model = models.resnet18(weights=models.ResNet18_Weights.IMAGENET1K_V1)
model.fc = nn.Linear(512, 10)  # nova cabeça pra 10 classes

# Feature extraction: só a cabeça treina
for param in model.parameters():
    param.requires_grad = False
for param in model.fc.parameters():
    param.requires_grad = True

optimizer = torch.optim.AdamW(model.fc.parameters(), lr=1e-3)
#+END_SRC

