blog/content/post/ai-cv.org
* Detecção: YOLO e a arte de achar objetos

Classificação responde "o que é isso?". Detecção responde "o que é e onde está?". YOLO (You Only Look Once) faz as duas coisas numa única passada, o que o torna rápido o bastante pra vídeo em tempo real.

A imagem é dividida numa grade S×S. Cada célula prediz B caixas delimitadoras. Cada caixa tem 5 números: ~(x, y, w, h, confiança)~ mais as probabilidades das C classes. O ~x~ e ~y~ são relativos à célula; o ~w~ e ~h~ são relativos a âncoras pré-definidas (formas típicas de caixa: retangular horizontal, quadrada, retangular vertical). A confiança diz "tem um objeto aqui?". O modelo prediz deslocamentos em relação às âncoras, não coordenadas absolutas.

A loss tem três componentes: regressão das caixas (só nas células que contêm objetos), confiança (objeto vs fundo, em todas as células), e classificação (só nas células com objeto). Depois da predição, Non-Maximum Suppression (NMS) remove caixas redundantes: ordene por score, pegue a maior, suprima todas com IoU > 0.5, repita.

#+BEGIN_SRC python
def nms(boxes, scores, iou_threshold=0.5):
    order = np.argsort(scores)[::-1]
    keep = []
    while len(order) > 0:
        keep.append(order[0])
        if len(order) == 1:
            break
        ious = box_iou_matrix(boxes[order[0]], boxes[order[1:]])
        order = order[1:][ious < iou_threshold]
    return keep
#+END_SRC

As métricas são mAP@0.5 (PASCAL VOC) e mAP@0.5:0.95 (COCO, bem mais rigoroso). Um detector com 50 de mAP no COCO já é muito bom.

* Segmentação: classificando cada pixel

Segmentação semântica (U-Net) rotula cada pixel com uma classe ("isso é carro, isso é estrada, isso é árvore"). Segmentação de instâncias (Mask R-CNN) vai além: separa "carro A" de "carro B", mesmo sendo a mesma classe.

A U-Net tem formato de U. O encoder (lado esquerdo) comprime a imagem progressivamente, capturando contexto global. O decoder (lado direito) restaura a resolução espacial. Entre eles, skip connections entregam features de alta resolução do encoder diretamente ao decoder, preservando bordas finas que seriam perdidas na compressão.

A loss combina cross-entropy (estável, bons gradientes iniciais) e Dice loss (otimiza sobreposição de máscara diretamente, robusta a desbalanceamento de classes). A fórmula do Dice: ~2 * |A ∩ B| / (|A| + |B|)~. É o padrão em imagem médica, onde o objeto de interesse (tumor) ocupa 1% dos pixels.

Mask R-CNN adiciona um branch de máscara ao detector Faster R-CNN. O RoIAlign (em vez de RoIPool) é o detalhe crítico: ele amostra features em coordenadas float exatas via interpolação bilinear, sem arredondar pra inteiro. O RoIPool perdia 3-4 pontos de mAP por causa do arredondamento.

* Gerando imagens: de GANs a difusão

Uma GAN é um jogo entre duas redes. O gerador cria imagens a partir de ruído aleatório. O discriminador tenta distinguir imagens reais de falsas. Os dois treinam em competição: o gerador melhora pra enganar o discriminador, o discriminador melhora pra não ser enganado.

Funciona bem pra geração rápida (milissegundos) e transferência de estilo. Mas é instável: mode collapse (o gerador produz uma única imagem convincente e para de explorar), discriminator-wins (o discriminador fica bom demais e o gradiente do gerador some), oscilação. A DCGAN estabeleceu cinco regras pra estabilizar: convoluções com stride (nada de pooling), BatchNorm nos dois lados, nada de fully-connected, ReLU no gerador, LeakyReLU no discriminador.

Modelos de difusão vieram depois e resolveram o problema de estabilidade. A ideia: pegue uma imagem, adicione ruído gaussiano em 1000 passos até virar ruído puro. Depois treine uma rede (U-Net) pra reverter um passo de cada vez. A rede aprende a prever o ruído adicionado, não a imagem final. O treino é uma única linha: ~loss = MSE(ruído_real, ruído_previsto)~. Sem adversarial, sem colapso de modo, sem oscilação. Só regressão.

O insight que torna isso viável: você não precisa rodar 1000 passos pra treinar. A fórmula ~x_t = √(ᾱ_t)·x_0 + √(1-ᾱ_t)·ε~ te dá qualquer passo intermediário diretamente da imagem limpa. Você amostra um ~t~ aleatório, aplica a fórmula, e treina a rede pra prever ~ε~ a partir de ~x_t~ e ~t~. O sampling (gerar imagem) roda os 1000 passos de trás pra frente, partindo do ruído puro. DDIM acelera isso 20-50x reformulando como EDO determinística.

#+BEGIN_SRC python
def q_sample(x_0, t, sqrt_alpha_cumprod, sqrt_one_minus_alpha_cumprod, noise=None):
    if noise is None:
        noise = torch.randn_like(x_0)
    return sqrt_alpha_cumprod[t] * x_0 + sqrt_one_minus_alpha_cumprod[t] * noise

# Treino: uma linha
noise_pred = model(x_t, t)
loss = F.mse_loss(noise_pred, noise)
#+END_SRC

Stable Diffusion roda esse processo no espaço latente de um VAE, não no espaço de pixels. A imagem 512x512x3 vira 64x64x4 (48x menos dimensões). Um encoder de texto (CLIP) condiciona a geração via cross-attention em cada camada da U-Net. E o Classifier-Free Guidance (CFG) mistura predição condicional e incondicional: ~ε = ε_uncond + w*(ε_cond - ε_uncond)~, com w=7.5 típico. LoRA (Low-Rank Adaptation) permite fine-tuning com adaptadores de 10-50 MB que cabem em GPU de consumidor.

