ai-cv/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Detecção: YOLO e a arte de achar objetos
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
Classificação responde &#34;o que é isso?&#34;. Detecção responde &#34;o que é e onde está?&#34;. YOLO (You Only Look Once) faz as duas coisas numa única passada, o que o torna rápido o bastante pra vídeo em tempo real.</p>
<p>
A imagem é dividida numa grade S×S. Cada célula prediz B caixas delimitadoras. Cada caixa tem 5 números: <code>(x, y, w, h, confiança)</code> mais as probabilidades das C classes. O <code>x</code> e <code>y</code> são relativos à célula; o <code>w</code> e <code>h</code> são relativos a âncoras pré-definidas (formas típicas de caixa: retangular horizontal, quadrada, retangular vertical). A confiança diz &#34;tem um objeto aqui?&#34;. O modelo prediz deslocamentos em relação às âncoras, não coordenadas absolutas.</p>
<p>
A loss tem três componentes: regressão das caixas (só nas células que contêm objetos), confiança (objeto vs fundo, em todas as células), e classificação (só nas células com objeto). Depois da predição, Non-Maximum Suppression (NMS) remove caixas redundantes: ordene por score, pegue a maior, suprima todas com IoU &gt; 0.5, repita.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">nms</span><span class="p">(</span><span class="n">boxes</span><span class="p">,</span> <span class="n">scores</span><span class="p">,</span> <span class="n">iou_threshold</span><span class="o">=</span><span class="mf">0.5</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">order</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">argsort</span><span class="p">(</span><span class="n">scores</span><span class="p">)[::</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="n">keep</span> <span class="o">=</span> <span class="p">[]</span>
</span></span><span class="line"><span class="cl">    <span class="k">while</span> <span class="nb">len</span><span class="p">(</span><span class="n">order</span><span class="p">)</span> <span class="o">&gt;</span> <span class="mi">0</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="n">keep</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="n">order</span><span class="p">[</span><span class="mi">0</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">        <span class="k">if</span> <span class="nb">len</span><span class="p">(</span><span class="n">order</span><span class="p">)</span> <span class="o">==</span> <span class="mi">1</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">            <span class="k">break</span>
</span></span><span class="line"><span class="cl">        <span class="n">ious</span> <span class="o">=</span> <span class="n">box_iou_matrix</span><span class="p">(</span><span class="n">boxes</span><span class="p">[</span><span class="n">order</span><span class="p">[</span><span class="mi">0</span><span class="p">]],</span> <span class="n">boxes</span><span class="p">[</span><span class="n">order</span><span class="p">[</span><span class="mi">1</span><span class="p">:]])</span>
</span></span><span class="line"><span class="cl">        <span class="n">order</span> <span class="o">=</span> <span class="n">order</span><span class="p">[</span><span class="mi">1</span><span class="p">:][</span><span class="n">ious</span> <span class="o">&lt;</span> <span class="n">iou_threshold</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">keep</span></span></span></code></pre></div>
</div>
<p>
As métricas são mAP@0.5 (PASCAL VOC) e mAP@0.5:0.95 (COCO, bem mais rigoroso). Um detector com 50 de mAP no COCO já é muito bom.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Segmentação: classificando cada pixel
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>
Segmentação semântica (U-Net) rotula cada pixel com uma classe (&#34;isso é carro, isso é estrada, isso é árvore&#34;). Segmentação de instâncias (Mask R-CNN) vai além: separa &#34;carro A&#34; de &#34;carro B&#34;, mesmo sendo a mesma classe.</p>
<p>
A U-Net tem formato de U. O encoder (lado esquerdo) comprime a imagem progressivamente, capturando contexto global. O decoder (lado direito) restaura a resolução espacial. Entre eles, skip connections entregam features de alta resolução do encoder diretamente ao decoder, preservando bordas finas que seriam perdidas na compressão.</p>
<p>
A loss combina cross-entropy (estável, bons gradientes iniciais) e Dice loss (otimiza sobreposição de máscara diretamente, robusta a desbalanceamento de classes). A fórmula do Dice: <code>2 * |A ∩ B| / (|A| + |B|)</code>. É o padrão em imagem médica, onde o objeto de interesse (tumor) ocupa 1% dos pixels.</p>
<p>
Mask R-CNN adiciona um branch de máscara ao detector Faster R-CNN. O RoIAlign (em vez de RoIPool) é o detalhe crítico: ele amostra features em coordenadas float exatas via interpolação bilinear, sem arredondar pra inteiro. O RoIPool perdia 3-4 pontos de mAP por causa do arredondamento.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Gerando imagens: de GANs a difusão
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>
Uma GAN é um jogo entre duas redes. O gerador cria imagens a partir de ruído aleatório. O discriminador tenta distinguir imagens reais de falsas. Os dois treinam em competição: o gerador melhora pra enganar o discriminador, o discriminador melhora pra não ser enganado.</p>
<p>
Funciona bem pra geração rápida (milissegundos) e transferência de estilo. Mas é instável: mode collapse (o gerador produz uma única imagem convincente e para de explorar), discriminator-wins (o discriminador fica bom demais e o gradiente do gerador some), oscilação. A DCGAN estabeleceu cinco regras pra estabilizar: convoluções com stride (nada de pooling), BatchNorm nos dois lados, nada de fully-connected, ReLU no gerador, LeakyReLU no discriminador.</p>
<p>
Modelos de difusão vieram depois e resolveram o problema de estabilidade. A ideia: pegue uma imagem, adicione ruído gaussiano em 1000 passos até virar ruído puro. Depois treine uma rede (U-Net) pra reverter um passo de cada vez. A rede aprende a prever o ruído adicionado, não a imagem final. O treino é uma única linha: <code>loss = MSE(ruído_real, ruído_previsto)</code>. Sem adversarial, sem colapso de modo, sem oscilação. Só regressão.</p>
<p>
O insight que torna isso viável: você não precisa rodar 1000 passos pra treinar. A fórmula <code>x_t = √(ᾱ_t)·x_0 + √(1-ᾱ_t)·ε</code> te dá qualquer passo intermediário diretamente da imagem limpa. Você amostra um <code>t</code> aleatório, aplica a fórmula, e treina a rede pra prever <code>ε</code> a partir de <code>x_t</code> e <code>t</code>. O sampling (gerar imagem) roda os 1000 passos de trás pra frente, partindo do ruído puro. DDIM acelera isso 20-50x reformulando como EDO determinística.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">q_sample</span><span class="p">(</span><span class="n">x_0</span><span class="p">,</span> <span class="n">t</span><span class="p">,</span> <span class="n">sqrt_alpha_cumprod</span><span class="p">,</span> <span class="n">sqrt_one_minus_alpha_cumprod</span><span class="p">,</span> <span class="n">noise</span><span class="o">=</span><span class="kc">None</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">noise</span> <span class="ow">is</span> <span class="kc">None</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="n">noise</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">randn_like</span><span class="p">(</span><span class="n">x_0</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">sqrt_alpha_cumprod</span><span class="p">[</span><span class="n">t</span><span class="p">]</span> <span class="o">*</span> <span class="n">x_0</span> <span class="o">+</span> <span class="n">sqrt_one_minus_alpha_cumprod</span><span class="p">[</span><span class="n">t</span><span class="p">]</span> <span class="o">*</span> <span class="n">noise</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Treino: uma linha</span>
</span></span><span class="line"><span class="cl"><span class="n">noise_pred</span> <span class="o">=</span> <span class="n">model</span><span class="p">(</span><span class="n">x_t</span><span class="p">,</span> <span class="n">t</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">loss</span> <span class="o">=</span> <span class="n">F</span><span class="o">.</span><span class="n">mse_loss</span><span class="p">(</span><span class="n">noise_pred</span><span class="p">,</span> <span class="n">noise</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
Stable Diffusion roda esse processo no espaço latente de um VAE, não no espaço de pixels. A imagem 512x512x3 vira 64x64x4 (48x menos dimensões). Um encoder de texto (CLIP) condiciona a geração via cross-attention em cada camada da U-Net. E o Classifier-Free Guidance (CFG) mistura predição condicional e incondicional: <code>ε = ε_uncond + w*(ε_cond - ε_uncond)</code>, com w=7.5 típico. LoRA (Low-Rank Adaptation) permite fine-tuning com adaptadores de 10-50 MB que cabem em GPU de consumidor.</p>
</div>
</div>
