ai-cv/index.html
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
Vídeo, 3D e o mundo além das fotos
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>
Vídeo é uma sequência de imagens mais a física que as conecta. Três abordagens: 2D+pool (CNN por frame, média dos embeddings, rápido mas cego a movimento), 3D convolutions (kernel com profundidade temporal, modela movimento diretamente, I3D infla pesos 2D do ImageNet), e spatio-temporal transformers (atenção dividida no tempo e no espaço, estado da arte).</p>
<p>
Nuvens de pontos são a saída bruta de sensores 3D (LiDAR). O PointNet processa cada ponto com o mesmo MLP e faz max-pooling global, garantindo invariância à permutação (a ordem dos pontos não importa). NeRF (Neural Radiance Fields) aprende um campo volumétrico contínuo: dado um ponto no espaço (x,y,z) e uma direção de visão (θ,φ), uma MLP prevê densidade e cor. O rendering integra amostras ao longo de raios com a equação de composição alfa.</p>
<p>
3D Gaussian Splatting substituiu NeRFs na prática. Em vez de uma MLP implícita, a cena é uma nuvem de milhões de gaussianas 3D explícitas, cada uma com posição, rotação, escala, opacidade e cor. O rendering projeta cada gaussiana 3D numa elipse 2D na tela e faz alpha compositing de trás pra frente. Treina em minutos, renderiza a 100+ fps. A extensão glTF da Khronos tornou portável.</p>
<p>
Vision Transformers (ViT) aplicam a arquitetura do &#34;Attention is All You Need&#34; a imagens. A imagem é cortada em patches 16x16, cada patch vira um token (como uma palavra), e um transformer padrão processa tudo. Um token [CLS] no início agrega a informação global. ViT precisa de mais dados que CNNs pra funcionar bem, mas com pré-treinamento auto-supervisionado (MAE: mascare 75% dos patches, reconstrua os pixels faltantes), bate CNNs com folga.</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
Visão além do visível: CLIP, VLMs e segmentação aberta
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>
CLIP (Contrastive Language-Image Pre-training) treina um encoder de imagem e um encoder de texto juntos. O objetivo: pares (imagem, legenda) correspondentes devem ficar próximos no espaço de embedding; pares não correspondentes, distantes. O resultado é um modelo que entende linguagem e visão no mesmo espaço.</p>
<p>
Isso permite classificação zero-shot: &#34;uma foto de um {gato}&#34; vs &#34;uma foto de um {cachorro}&#34;. Codifique os prompts de texto, codifique a imagem, argmax da similaridade de cosseno. Sem uma única imagem de treino daquelas classes. O prompt importa: usar 80 templates diferentes (&#34;uma foto de um {}&#34;, &#34;uma imagem borrada de um {}&#34;, &#34;um close-up de um {}&#34;) e tirar a média adiciona 1-3% de acurácia.</p>
<p>
Vision-Language Models (VLMs) como Qwen-VL e LLaVA conectam o encoder de visão a um LLM. A imagem vira tokens via ViT, um projetor MLP mapeia pro espaço do LLM, e o modelo de linguagem processa texto e imagem entrelaçados. O resultado é um chat que &#34;vê&#34;: você manda uma foto de uma planta e pergunta &#34;que espécie é essa?&#34;, e ele responde com texto.</p>
<p>
SAM 3 (Segment Anything Model 3) leva isso pra segmentação. Você dá um prompt de texto (&#34;ônibus escolar amarelo&#34;) e uma imagem. O modelo retorna máscaras pra todos os objetos que casam com o conceito, em uma única passada. A arquitetura junta detector de imagem, tracker baseado em memória e um &#34;presence head&#34; que separa &#34;esse conceito está aqui?&#34; de &#34;onde exatamente?&#34;, reduzindo falsos positivos.</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
De volta ao mundo real: deployment, OCR e tracking
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>
Modelos de visão em produção enfrentam restrições de latência e memória. MobileNetV3 e ConvNeXt-Tiny são as escolhas pra edge. Quantização INT8 reduz o modelo em 4x e acelera 2-4x com perda mínima de acurácia. O pipeline de deployment: PyTorch, ONNX, ONNX Runtime/TensorRT. Meça latência com warmup, sincronização de CUDA e percentis (p50, p95, p99), nunca com média.</p>
<p>
OCR é um pipeline de três estágios: detectar caixas de texto, reconhecer caracteres em cada caixa, ordenar o layout. O reconhecimento usa CRNN (CNN + BiLSTM + CTC loss). CTC (Connectionist Temporal Classification) alinha sequências de comprimentos diferentes sem precisar de anotação por caractere: ele marginaliza sobre todos os alinhamentos possíveis que colapsam no texto alvo. Modelos modernos (Donut, TrOCR) usam transformers ponta a ponta.</p>
<p>
Multi-object tracking associa detecções frame a frame. O SORT (2016) usa Filtro de Kalman pra prever posição + Hungarian algorithm pra matching ótimo. DeepSORT adiciona features de re-identificação. ByteTrack faz um segundo matching com detecções de baixa confiança, recuperando oclusões. A métrica HOTA (Higher Order Tracking Accuracy) decompõe detecção e associação, substituindo MOTA como padrão da comunidade.</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
O estado da arte em 2026: DiT, profundidade e modelos de mundo
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>
Diffusion Transformers (DiT) substituem a U-Net por um transformer. Os patches latentes (do VAE) viram tokens, e blocos transformer com AdaLN-Zero (conditioning via adaptative layer norm com pesos inicializados em zero) processam tudo. Rectified flow reformula a trajetória de difusão como uma linha reta (<code>x_t = (1-t)*x_0 + t*ε</code>) em vez da curva do DDPM, permitindo amostragem em 20 passos deterministicos em vez de 1000. SD3, FLUX e Sora usam isso.</p>
<p>
Monocular depth estimation prevê profundidade a partir de uma única imagem RGB, algo que era considerado impossível sem estereoscopia ou LiDAR. Funciona porque um ViT treinado em bilhões de imagens internaliza pistas de perspectiva, oclusão, gradiente de textura e perspectiva atmosférica como priors estatísticos. Depth Anything V3 é o padrão de 2026.</p>
<p>
World models são o Santo Graal: um modelo de vídeo que prevê os próximos segundos de uma cena, condicionado em ações. É um simulador aprendido. A arquitetura: Video DiT com 3D patch embedding (patches no espaço-tempo) e atenção dividida (temporal e espacial separadas pra evitar complexidade O((THW)²)). Sora 2 gera vídeo com áudio a partir de texto. Modelos de mundo robóticos simulam rollouts pra planejamento: o VLM planeja, o modelo de vídeo simula, a dinâmica inversa emite comandos de motor.</p>
</div>
</div>
